In [52]:
from sklearn.datasets import load_boston
import pandas as pd, numpy as np
%matplotlib inline
%pylab inline
import seaborn  as sns 
from sklearn.datasets import load_boston
import pylab as pl
import matplotlib.pyplot as plt

Populating the interactive namespace from numpy and matplotlib

In [53]:
movies = pd.read_csv('/Users/GGV/Desktop/sell_Data_Analyst/movies.csv',encoding = "ISO-8859-1")
ratings = pd.read_csv('/Users/GGV/Desktop/sell_Data_Analyst/ratings.csv')
users = pd.read_csv('/Users/GGV/Desktop/sell_Data_Analyst/users.csv')

In [54]:
movies.head(2)

,movie_id,title,release_date,video release date,IMDb_URL,unknown,Action,Adventure,Animation,Children's,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,Toy Story (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?Toy%20Story%2...,0,0,0,1,1,...,0,0,0,0,0,0,0,0,0,0
1,2,GoldenEye (1995),1-Jan-95,NaN,http://us.imdb.com/M/title-exact?GoldenEye%20(...,0,1,1,0,0,...,0,0,0,0,0,0,0,1,0,0

In [55]:
ratings.head(2)

   user_id  movie_id  rating  timestamp
0      196       242       3  881250949
1      186       302       3  891717742

In [56]:
users.head(2)

   user_id  age gender  occupation zip code
0        1   24      M  technician    85711
1        2   53      F       other    94043

# 1. What is the average rating given by all users?

In [57]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100000 entries, 0 to 99999
Data columns (total 4 columns):
user_id      100000 non-null int64
movie_id     100000 non-null int64
rating       100000 non-null int64
timestamp    100000 non-null int64
dtypes: int64(4)
memory usage: 3.1 MB

In [58]:
ratings.mean()

user_id      4.624848e+02
movie_id     4.255301e+02
rating       3.529860e+00
timestamp    8.835289e+08
dtype: float64

# 2. What is the range of the ratings given?

In [59]:
ratings.describe()

            user_id       movie_id         rating     timestamp
count  100000.00000  100000.000000  100000.000000  1.000000e+05
mean      462.48475     425.530130       3.529860  8.835289e+08
std       266.61442     330.798356       1.125674  5.343856e+06
min         1.00000       1.000000       1.000000  8.747247e+08
25%       254.00000     175.000000       3.000000  8.794487e+08
50%       447.00000     322.000000       4.000000  8.828269e+08
75%       682.00000     631.000000       4.000000  8.882600e+08
max       943.00000    1682.000000       5.000000  8.932866e+08

# 3. What is the standard deviation of the ratings given?

In [60]:
ratings.describe()

            user_id       movie_id         rating     timestamp
count  100000.00000  100000.000000  100000.000000  1.000000e+05
mean      462.48475     425.530130       3.529860  8.835289e+08
std       266.61442     330.798356       1.125674  5.343856e+06
min         1.00000       1.000000       1.000000  8.747247e+08
25%       254.00000     175.000000       3.000000  8.794487e+08
50%       447.00000     322.000000       4.000000  8.828269e+08
75%       682.00000     631.000000       4.000000  8.882600e+08
max       943.00000    1682.000000       5.000000  8.932866e+08

# 4. What is the age of 75th percentile of the users?

In [61]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 943 entries, 0 to 942
Data columns (total 5 columns):
user_id       943 non-null int64
age           943 non-null int64
gender        943 non-null object
occupation    943 non-null object
zip code      943 non-null object
dtypes: int64(2), object(3)
memory usage: 36.9+ KB

In [62]:
users.describe()

          user_id         age
count  943.000000  943.000000
mean   472.000000   34.051962
std    272.364951   12.192740
min      1.000000    7.000000
25%    236.500000   25.000000
50%    472.000000   31.000000
75%    707.500000   43.000000
max    943.000000   73.000000

# 5. How many action movies are there?

In [63]:
movies.columns

Index(['movie_id', 'title', 'release_date', 'video release date', 'IMDb_URL',
       'unknown', 'Action', 'Adventure', 'Animation', 'Children's', 'Comedy',
       'Crime', 'Documentary', 'Drama', 'Fantasy', 'Film-Noir', 'Horror',
       'Musical', 'Mystery', 'Romance', 'Sci-Fi', 'Thriller', 'War',
       'Western'],
      dtype='object')

In [64]:
movies.groupby('Action').count()['movie_id']

Action
0    1431
1     251
Name: movie_id, dtype: int64

# 6. How many horror movies are there?

In [65]:
movies.groupby('Horror').count()['movie_id']

Horror
0    1590
1      92
Name: movie_id, dtype: int64

# 7. List all the titles of all action movies which are also horror movies.

In [66]:
movies[['Action', 'Horror']].head()

   Action  Horror
0       0       0
1       1       0
2       0       0
3       1       0
4       0       0

In [67]:
movies[(movies['Action']== 1)& (movies['Horror']== 1)]['title']

16       From Dusk Till Dawn (1996)
100              Heavy Metal (1981)
182                    Alien (1979)
183         Army of Darkness (1993)
200             Evil Dead II (1987)
233                     Jaws (1975)
342      Alien: Resurrection (1997)
352              Deep Rising (1998)
451                   Jaws 2 (1978)
452                 Jaws 3-D (1983)
589    Hellraiser: Bloodline (1996)
664                  Alien 3 (1992)
667              Blood Beach (1981)
Name: title, dtype: object

In [68]:
pd.DataFrame(movies.groupby(['Action', 'Horror']).count()['movie_id'])

               movie_id
Action Horror
0      0           1352
       1             79
1      0            238
       1             13

# 8. What is the total number of users who gave above-average ratings?

In [69]:
ratings.mean()

user_id      4.624848e+02
movie_id     4.255301e+02
rating       3.529860e+00
timestamp    8.835289e+08
dtype: float64

In [70]:
len(ratings[ratings['rating'] > ratings.rating.mean()])

55375

# 9. Provide insights on the genre preferences by males and females

In [71]:
# dataframe merge 

final_table = pd.DataFrame()
final_table = pd.merge(users, ratings, on='user_id')
final_table = pd.merge(final_table,movies, on = 'movie_id' )

In [84]:
final_table.head(2)

,user_id,age,gender,occupation,zip code,movie_id,rating,timestamp,title,release_date,...,Fantasy,Film-Noir,Horror,Musical,Mystery,Romance,Sci-Fi,Thriller,War,Western
0,1,24,M,technician,85711,61,4,878542420,Three Colors: White (1994),1-Jan-94,...,0,0,0,0,0,0,0,0,0,0
1,13,47,M,educator,29206,61,4,882140552,Three Colors: White (1994),1-Jan-94,...,0,0,0,0,0,0,0,0,0,0

In [73]:
final_table.groupby("gender").agg({"Action": np.sum,"Adventure":np.sum,"Animation":np.sum,"Comedy":np.sum,"Crime":np.sum,"Documentary":np.sum,"Drama":np.sum,"Fantasy":np.sum,"Film-Noir":np.sum,"Horror": np.sum,"Musical": np.sum,"Mystery": np.sum,"Romance": np.sum,"Sci-Fi": np.sum,"Thriller": np.sum,"War": np.sum,"Western": np.sum})

,Action,Thriller,Fantasy,Mystery,Documentary,Adventure,Horror,Western,Sci-Fi,Drama,Crime,Musical,Romance,War,Film-Noir,Animation,Comedy
gender,,,,,,,,,,,,,,,,,
F,5442,5086,363,1314,187,3141,1197,371,2629,11008,1794,1442,5858,2189,385,995,8068
M,20147,16786,989,3931,571,10612,4120,1483,10101,28887,6261,3512,13603,7209,1348,2610,21764

# 10. What is the distribution of ratings across age groups? (buckets of 5)

In [74]:
# helper function 

def round(x):
    return int(round(x/5.0)*5.0)

In [75]:
users['age_'] = (users['age']/5.0).astype(int)*5.0

In [76]:

users_ = pd.DataFrame()
users_ = pd.merge(users, ratings, on='user_id')

In [77]:
pd.DataFrame(users_.groupby(['age_','rating']).count()['user_id'])

             user_id
age_ rating
5.0  1             1
     2             4
     3             9
     4            19
     5            10
10.0 1           100
     2            91
     3           189
     4           244
     5           195
15.0 1           529
     2           851
     3          1998
     4          2425
     5          1559
20.0 1          1479
     2          2249
     3          4814
     4          5925
     5          3860
25.0 1          1407
     2          2584
     3          5844
     4          7310
     5          4063
30.0 1           991
     2          1592
     3          3836
     4          4788
     5          3029
...              ...
45.0 1           410
     2           606
     3          1766
     4          2455
     5          1653
50.0 1           196
     2           597
     3          1700
     4          2130
     5          1267
55.0 1            94
     2           317
     3           708
     4          1026
     5           669
60.0 1            58
     2           207
     3           563
     4           836
     5           445
65.0 1            18
     2            58
     3           136
     4           211
     5            91
70.0 1             9
     2            20
     3            46
     4            78
     5            44

[70 rows x 1 columns]

# 11. What is the most watched movie for each month from October 1997 to March 1998? (Note: - watched movies refers to movies that received ratings - if insufficient time, please provide a step-by-step explanation for how you may derive the result)

In [78]:
# helper function 

import datetime
def unix_datetime(x):
    temp = datetime.datetime.fromtimestamp(x).strftime('%Y-%m')
    #temp = datetime.datetime.fromtimestamp(x).strftime('%Y-%m-%d %H:%M:%S')
    return temp

In [79]:
# unix time -> timestamp 

ratings['datetime'] = ratings['timestamp'].apply(lambda x :unix_datetime(x) )

In [80]:
# period confine 

rating_filter = ratings[(ratings['datetime']>'1997-10') & (ratings['datetime']<'1998-03')].sort(['datetime','movie_id'])


rating_filter.head()

rating_filter_ = rating_filter.groupby(['datetime','movie_id']).count().reset_index()

/Users/GGV/anaconda/envs/GGV_DASH/lib/python3.4/site-packages/ipykernel/__main__.py:3: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)
  app.launch_new_instance()

In [83]:
rating_filter_


rating_filter_.sort(['datetime','user_id'],ascending=False).groupby('datetime').head(1).sort('datetime')

/Users/GGV/anaconda/envs/GGV_DASH/lib/python3.4/site-packages/ipykernel/__main__.py:4: FutureWarning: sort(columns=....) is deprecated, use sort_values(by=.....)

     datetime  movie_id  user_id  rating  timestamp
49    1997-11        50      152     152        152
1385  1997-12        50       68      68         68
2902  1998-01       313       89      89         89
4260  1998-02       313       73      73         73

# 12. Display in cohort monthly, what is the percentage of user who review this month review again next month? (Note: - if insufficient time, please provide a step-by-step explanation for how you may derive the result)

In [82]:
# cohort analysis PANDAS : http://www.gregreda.com/2015/08/23/cohort-analysis-with-python/